Repository: K227-arch/Rasberry-model
Catalog: runyoro_nmt/data/tm/runyoro_en.tmx
Source language: nyk
Languages: en

source: engorombe
en: [COMMON_ANIMALS_NOUN] stunted child, cow

source: engoye
en: [GENERAL_NOUN] clothes

source: engungumale
en: [GENERAL_NOUN] obstinate

source: engundizi
en: [GENERAL_NOUN] weakling; long-lived person

source: engwara
en: [GENERAL_NOUN] horn trumpet

source: engweterano
en: [GENERAL_NOUN] from generation to generation

source: enimi
en: [COMMON_ANIMALS_NOUN] bull

source: enjaahi
en: [GENERAL_NOUN] Indian hemp, opium, bhang

source: enjabule
en: [GENERAL_NOUN] cropped ears

source: enjagirizi
en: [GENERAL_NOUN] flatterer

source: enjatu
en: [NATURE_AND_ENVIRONMENT_NOUN] destructive gale

source: enjenga
en: [GENERAL_NOUN] many banana gardens together

source: enjoga
en: [GENERAL_NOUN] water container

source: enjoka
en: [COMMON_ANIMALS_NOUN] snake; internal pains

source: enjoki
en: [GENERAL_NOUN] bees

source: enjuba
en: [GENERAL_NOUN] blood pudding

source: enjunza
en: [GENERAL_NOUN] jigger

source: enkambi
en: [GENERAL_NOUN] restcamp

source: enkali
en: [GENERAL_NOUN] urine

source: enkango
en: [GENERAL_NOUN] end goal, stopping-place

source: enkenko
en: [GENERAL_NOUN] vinegar

source: enkerebe
en: [COMMON_ANIMALS_NOUN] dog-faced ape, baboon

source: enkana
en: [GENERAL_NOUN] a neck swelling

source: enjuza
en: [GENERAL_NOUN] twisted papyrus ropes

source: enjwaranna
en: [GENERAL_NOUN] way of clothing, attire

source: enkaanaana enkaina
en: [COMMON_ANIMALS_NOUN] flowers donkey

source: enkaka
en: [GENERAL_NOUN] heart-burn, anthrax

source: enkamba-be
en: [GENERAL_NOUN] diligent, work hard

source: enkangaasi
en: [GENERAL_NOUN] hoof

source: enkanjaiga
en: [GENERAL_NOUN] times

source: enkaranga
en: [GENERAL_NOUN] huge elephant

source: enkarwa
en: [GENERAL_NOUN] leg trick in wrestling

source: enkeeho
en: [GENERAL_NOUN] waning moon

source: enkenyera
en: [GENERAL_NOUN] groaning, discontent; pain, ache

source: enkere
en: [GENERAL_NOUN] water frog

source: enkerembe
en: [GENERAL_NOUN] infant, baby

source: entabukatabuka
en: [GENERAL_NOUN] muddle, confusion, commotion

source: entaka
en: [GENERAL_NOUN] clod, sod

source: entangize
en: [GENERAL_NOUN] time just after sunrise

source: entaratazi
en: [GENERAL_NOUN] wanderer, roamer

source: enteerabwire
en: [COMMON_ANIMALS_NOUN] cock

source: enteeraniza
en: [GENERAL_NOUN] a way of joining

source: entemamuhoro
en: [GENERAL_NOUN] mantis

source: enterebuki
en: [GENERAL_NOUN] shirker, dodger

source: entimbo
en: [GOVERNANCE_AND_ADMINISTRATION_NOUN] small royal drum

source: entoijo
en: [COMMON_ANIMALS_NOUN] freshly churned cow ghee

source: entongana
en: [GENERAL_NOUN] defence; apology; pleading

source: entajumba
en: [GENERAL_NOUN] guinea fowl

source: entama
en: [GENERAL_NOUN] mouthful

source: entale
en: [COMMON_ANIMALS_NOUN] a lion

source: entambu
en: [GENERAL_NOUN] pace, short distance, strides

source: entandikiro
en: [GENERAL_NOUN] beginning, start, origin

source: entarutahu
en: [GENERAL_NOUN] walk very quickly

source: entebe
en: [GENERAL_NOUN] chair

source: entema
en: [GENERAL_NOUN] small calabash cup

source: entenyi
en: [GENERAL_NOUN] trial by ordeal

source: entimagizi
en: [GOVERNANCE_AND_ADMINISTRATION_NOUN] malachite king-fisher

source: entimbure
en: [GENERAL_NOUN] mixed food

source: entondo
en: [COMMON_ANIMALS_NOUN] small type of grasshopper

source: entongole
en: [GENERAL_NOUN] kind of harp

source: entoole
en: [GENERAL_NOUN] water frog, stupid person

source: entumba
en: [GENERAL_NOUN] a loud fart

source: entulirra
en: [GENERAL_NOUN] self-sown potatoes

source: entundwa
en: [GENERAL_NOUN] very lightcoloured millet

source: entuuru
en: [COMMON_ANIMALS_NOUN] a wild cat

source: enumi
en: [COMMON_ANIMALS_NOUN] bull: a male cow

source: enyakibabi
en: [COMMON_ANIMALS_NOUN] a green coloured snake

source: enturabusa
en: [GENERAL_NOUN] swollen gland

source: enturro
en: [GENERAL_NOUN] sourness, acidity

source: entuuha
en: [COMMON_ANIMALS_NOUN] crested crane

source: entuuyo
en: [GENERAL_NOUN] state of perspiration, sweat

source: entyabiri
en: [BIOLOGY_NOUN] a species of mushrooms

source: enuuni
en: [GENERAL_NOUN] duodenum

source: enyaani
en: [GENERAL_NOUN] coffee-berries

source: enyabatimbo
en: [GENERAL_NOUN] silkworm

source: enyahukana
en: [GENERAL_NOUN] difference

source: enyakabara
en: [GENERAL_NOUN] native-born

source: enyama
en: [GENERAL_NOUN] meat, flesh, muscle

source: enyamahamba
en: [GENERAL_NOUN] type of edible mushroom

source: entumbi
en: [COMMON_ANIMALS_NOUN] a corpse of cattle

source: entumbwe
en: [COMMON_ANIMALS_NOUN] calf

source: entuumuuki
en: [GENERAL_NOUN] blankshot

source: enusu
en: [ECONOMICS_AND_COMMERCE_NOUN] coin: metallic currency

source: enyamaiswa
en: [GENERAL_NOUN] an animal

source: enturuba
en: [GENERAL_NOUN] gurgle, bubble, slobber

source: entuutu
en: [COMMON_ANIMALS_NOUN] cape goose berries

source: entwe
en: [GENERAL_NOUN] ears of millet

source: enwa
en: [COMMON_ANIMALS_NOUN] hornet,wasps

source: enyabisaaniko
en: [GENERAL_NOUN] evening star

source: enyakibisi
en: [GENERAL_NOUN] fresh beans

source: enyamagaro n
en: [GENERAL_NOUN] pincers, pliers

source: Eba
en: [GENERAL_VERB] to be forgotten

source: Ebabura
en: [GENERAL_NOUN] of his/her relative

source: Ebiihabiiha
en: [GENERAL_VERB] to deceive oneself

source: Ebondoiga
en: [COMMON_ANIMALS_VERB] to vomit (dog etc.)

source: Ebundaaza
en: [GENERAL_VERB] to humble oneself

source: Eceeba
en: [GENERAL_VERB] to wear many clothes(woman)

source: Ecunda
en: [GENERAL_VERB] to drag oneself along

source: Efoora
en: [GENERAL_VERB] to pretend to be

source: egaa rraamu,
en: [GENERAL_VERB] to pluck up courage

source: Ebaarra
en: [GENERAL_VERB] to be cautious

source: Ebabara
en: [GENERAL_VERB] to beware

source: Ebaganizaamu
en: [GENERAL_VERB] to withdraw oneself

source: Ebairuka
en: [GENERAL_VERB] to be startled

source: Ebeteka
en: [GENERAL_VERB] to sit down carelessly

source: Ebiihiirra
en: [GENERAL_VERB] to boast groundlessly

source: Ebiihiraniza
en: [GENERAL_VERB] to provoke one another

source: Ebiijagura
en: [GENERAL_VERB] to belch

source: ebin ga
en: [GENERAL_VERB] to fly for refuge

source: Ebumbiirra
en: [GENERAL_VERB] to wrap oneself up

source: Ebwa
en: [GENERAL_VERB] to forget

source: Ecencura
en: [GENERAL_VERB] to fully understand, comprehend

source: Ecumiitiriza
en: [GENERAL_VERB] to think deeply

source: ecundacu nda,
en: [GENERAL_VERB] to rock oneself

source: Ecuraniza
en: [GENERAL_VERB] to sit properly

source: Ecwacwana
en: [GENERAL_VERB] to writhe, wag, wriggle

source: Edikya
en: [GENERAL_VERB] to fall heavily

source: Efaafaaniza
en: [GENERAL_VERB] to be dirty, slovenly

source: Efuba
en: [GENERAL_VERB] to hide

source: Ega
en: [GENERAL_VERB] to learn

source: Egama
en: [GENERAL_VERB] to starve

source: Egambiirra
en: [GENERAL_VERB] to exhort oneself

source: Eganyira
en: [GENERAL_VERB] to pity oneself

source: Eganira
en: [GENERAL_VERB] to leave off doing

source: Egejageja
en: [GENERAL_VERB] to malinger

source: Egemba
en: [GENERAL_VERB] to shave oneself

source: Egemuliza
en: [GENERAL_VERB] to fetch one's food

source: Egesa
en: [GENERAL_VERB] to teach, educate

source: Egiza
en: [GENERAL_VERB] to pretend

source: Egonyoorra
en: [GENERAL_VERB] to stretch oneself

source: Egurukya
en: [GENERAL_VERB] to deny having done

source: Ehaisa
en: [GENERAL_VERB] to flatter oneself, boast

source: Ehakana
en: [GENERAL_VERB] to deny knowledge of

source: Ebengeka
en: [GENERAL_VERB] to lean sideways

source: Ehenyenga
en: [GENERAL_NOUN] forge

source: Ehingahingisa
en: [GENERAL_VERB] to be changeable

source: Ehoima
en: [GENERAL_VERB] To be quarrelsome

source: Eganya
en: [GENERAL_VERB] to be lazy, weak

source: Eganyiirra
en: [GENERAL_NOUN] become lazy

source: Egarukamu
en: [GENERAL_VERB] to repent, reconcile

source: Egegecrra
en: [GENERAL_VERB] to handle carefully

source: Egema
en: [GENERAL_VERB] to bend, be flexible

source: Egendera
en: [GENERAL_VERB] to take oneself off

source: Egenya
en: [GENERAL_VERB] To frown

source: Egogeza
en: [GENERAL_VERB] to be self

source: Egonesa
en: [GENERAL_VERB] to feign sleep

source: Egoora
en: [GENERAL_VERB] to enjoy oneself

source: Ebaabira
en: [GENERAL_VERB] to boast

source: Ehara
en: [GENERAL_VERB] to scratch oneself, avoid

source: Ehemura
en: [GENERAL_VERB] to debase oneself

source: Ehenya
en: [GENERAL_VERB] to search diligently

source: eh.tita,
en: [GENERAL_VERB] to work tirelessly

source: Ehinguliriza
en: [GENERAL_VERB] to surround, go round

source: Ehiringisa
en: [GENERAL_VERB] to roll

source: Ehonga
en: [GENERAL_VERB] to dedicate oneself

source: Ebooga
en: [POLITICS_AND_CURRENT_AFFAIRS_VERB] to republic an acquaintance

source: Ehoza
en: [GENERAL_VERB] to lend

source: Ehungura
en: [GENERAL_VERB] to put on airs

source: Ehuuga
en: [GENERAL_VERB] to rinse

source: Ebyohya
en: [GENERAL_VERB] to change one's mind

source: Ejuura
en: [GENERAL_VERB] to undress oneself

source: Ekanga
en: [GENERAL_VERB] to be indolent, lazy

source: Ekaranduza
en: [GENERAL_VERB] to clear the throat

source: Ekeerreema
en: [GENERAL_VERB] to reflect_ ponder

source: Ekima
en: [GENERAL_VERB] to bide

source: Ekingira
en: [GENERAL_VERB] to shut oneself in

source: Ekonga
en: [GENERAL_NOUN] shrug the shoulders

source: Ekopa
en: [GENERAL_VERB] to buy on credit

source: Ebotoora
en: [GENERAL_VERB] to rub oneself

source: Ehotora
en: [GENERAL_VERB] To wind

source: Ehugya
en: [GENERAL_VERB] to ignore, pretend

source: Ehuuta
en: [GENERAL_VERB] to walk very fast

source: Ebyahyaniza
en: [GENERAL_VERB] to fidget

source: ejw eka
en: [GENERAL_NOUN] oneself

source: Ekaakura
en: [GENERAL_VERB] to scratch oneself

source: ekagu ra,
en: [GENERAL_VERB] to taste(food) again, repeat

source: Ekaguza
en: [GENERAL_VERB] to examine oneself, reflect

source: Ekeehereza
en: [GENERAL_VERB] to draw in stomach

source: Ekcndura
en: [GENERAL_VERB] to gird oneself tightly

source: Ekilka
en: [GENERAL_VERB] to be cross wise

source: Ekooka
en: [GENERAL_VERB] to retch

source: Ekoonyera
en: [GENERAL_VERB] to help oneself

source: Ekubakuba
en: [GENERAL_VERB] to become tangled

source: Ekubirana
en: [GENERAL_VERB] to take one's ease

source: Ekugusa
en: [GENERAL_VERB] to slip past

source: Ekulingilrra
en: [GENERAL_VERB] to be round, spherical

source: Ekumba
en: [GENERAL_VERB] to join with others

source: Ekumbya
en: [GENERAL_VERB] to roll oneself

source: Ekuusa
en: [GENERAL_VERB] to rub oneself

source: Ekwasa
en: [GENERAL_VERB] to make excuses

source: Emanya
en: [GENERAL_VERB] to be selfish, vain

source: Emanyisa
en: [GENERAL_VERB] to make oneself

source: Emigiza
en: [GENERAL_VERB] to squeeze oneself against

source: Emogora
en: [GENERAL_VERB] to make a grimace

source: Emwa
en: [GENERAL_VERB] to shave oneself

source: Ena
en: [GENERAL_NOUN] All of me

source: Enegura
en: [GENERAL_VERB] to regain one's strength

source: Enuuba
en: [GENERAL_VERB] to become miserable, unhappy

source: Eoyini
en: [GENERAL_NOUN] self, selves

source: Epaoka
en: [GENERAL_VERB] to be proud

source: Eraga
en: [GENERAL_VERB] to vow, pledge, promise

source: Ekubiriza
en: [GENERAL_NOUN] earnestly entreat

source: Ekukumika
en: [GENERAL_VERB] to hide, escape

source: Ekuliiriza
en: [GENERAL_VERB] to take upon oneself

source: Ekulingura
en: [GENERAL_VERB] to roll, wallow

source: Ekuma
en: [GENERAL_VERB] to sit nicely

source: Ekuuma
en: [GENERAL_VERB] to chew the cud

source: Ekuuyuuya
en: [GENERAL_VERB] to shade wings (termites)

source: Emaanyura
en: [GENERAL_VERB] pull out one's hair

source: Embi
en: [GENERAL_NOUN] Both

source: Emererwa
en: [GENERAL_VERB] To have pain

source: Endereza
en: [GENERAL_VERB] to oppress, bully, afflict

source: Eoka
en: [GENERAL_NOUN] self, selves

source: Eoyuma
en: [GENERAL_NOUN] behind

source: Eragaza
en: [GENERAL_VERB] to wipe oneself

source: Empooka
en: [GENERAL_NOUN] survivor

source: Empugutani
en: [GENERAL_NOUN] forgetful, scatterbrained person

source: Empulirro
en: [GENERAL_NOUN] ear passage

source: Empunu
en: [COMMON_ANIMALS_NOUN] Pig, wild bear

source: Emyerande
en: [GENERAL_NOUN] potatoes uprooted from runners

source: Empya
en: [GENERAL_NOUN] way of burning

source: Emyehurro
en: [GENERAL_NOUN] conceit, boastfulness

source: Emyekuniko
en: [GENERAL_NOUN] pride, arrogance, unnecessary quietness

source: Emyesungo
en: [GENERAL_NOUN] cheeky, rudeness, perversity, affectation

source: Empuku
en: [GENERAL_NOUN] weevil

source: Empungira
en: [GENERAL_NOUN] sleeping-sickness

source: Empurizana
en: [GENERAL_NOUN] Communication

source: Emputa
en: [GENERAL_NOUN] wounded person

source: Empyo
en: [COMMON_ANIMALS_NOUN] crocodile

source: Emyehaahiro
en: [GENERAL_NOUN] boasting, selfishness

source: Emyehembo
en: [GENERAL_NOUN] conceit, boastfulness

source: Emyekuzo
en: [GENERAL_NOUN] conceit, boastful

source: emyenda ya'bunyoro
en: [GENERAL_NOUN] praise, self-exaltation, boasting

source: Emyombekere
en: [GENERAL_NOUN] style of building, architecture

source: Enaanaasi
en: [GENERAL_NOUN] pineapple

source: Encamparya
en: [GENERAL_NOUN] withered breasts

source: Encikinya
en: [GENERAL_NOUN] Flies

source: Encompya
en: [GENERAL_NOUN] untrustworthy, deceitful person, mischief-maker

source: Encwangya
en: [GENERAL_NOUN] tricky person, unreliable person

source: Endaade
en: [COMMON_ANIMALS_NOUN] large, long-legged cock

source: Endaawa
en: [COMMON_ANIMALS_NOUN] a castrated bull

source: Endagaano
en: [GENERAL_NOUN] agreement, covenant, bargain

source: Endagalika
en: [GENERAL_NOUN] odd one, fallen thing

source: Endahiro
en: [GENERAL_NOUN] oath, vow, protestation

source: Endale
en: [GENERAL_NOUN] wild yam

source: Endangaazi
en: [GENERAL_NOUN] hartebeest

source: Endeberwamu
en: [GENERAL_NOUN] looking-glass, mirror

source: Endebolebo
en: [GENERAL_NOUN] border, edge

source: Endambi
en: [GENERAL_NOUN] tapeworm

source: Enamba
en: [GENERAL_NOUN] hole in the earth

source: Enceke
en: [GENERAL_NOUN] weakly person, invalid

source: Encu
en: [GENERAL_NOUN] fish

source: Encuro
en: [GENERAL_NOUN] a measure; time

source: Endabukya
en: [GENERAL_NOUN] sharp, clever person

source: endamya
en: [GENERAL_NOUN] worship, ritual

source: Endebe
en: [GENERAL_NOUN] small bell-like ornament

source: Endehwa
en: [GENERAL_NOUN] Fine

source: Enderalera
en: [GENERAL_NOUN] lower part of abdomen

source: Endigito
en: [GENERAL_INTERJ] sound of running footsteps

source: Endiirakumara
en: [COMMON_ANIMALS_NOUN] a wild dog

source: Endimi
en: [GENERAL_NOUN] languages, tongues

source: Endimiro
en: [GENERAL_NOUN] cultivated plot, field

source: Endobo
en: [GENERAL_NOUN] fish-hook

source: Nyineeka afeera aka ye'.
en: The house owner dies for his home

source: fa
en: To die, be destroyed, become useless

source: amaiso; amatu; obusaija
en: Become blind; Become deaf; Become impotent

source: faabbiina
en: To work hard

source: kukaba kufaabbiina kw 'amani kwija kumara enju enu; Mugume akaba nafaabbiinisibwa enju ye obu yahoire yahuumura
en: It was real hard work finishing this house; It was the construction of his house that made Mugume work hard, he has come to rest after finishing it

source: faafaana
en: To come to nothing, be destroyed, wear out

source: akafaafaanira mukyaro; akakira muno kufaafaanizibwa obulemu
en: He/she came ended up in ruins while in the village; Be/she was worn out by the war

source: faafaaniza
en: To throw about, give away, waste

source: faahongana
en: To mind each other, care for each other

source: nooha ayafaahonganisize abantu abo; ira kabataafahongaana? enju ye efaakaire kundi
en: Who have made those people care for each other, they never did so in the past; His house looks very untidy

source: faakuuza
en: To make a rustling noise (e.g. Animal in grass), scuffle

source: feekya
en: To snuffle

source: feerra
en: To die for on, on behalf of

source: Yesu Kiristo akatufeerra hamusalaba
en: Jesus Christ died for us on the cross

source: feerwa
en: To be bereaved of, lose.

source: fiisa
en: Die

source: abaana be babiri akabafiisiza Kyaka
en: She lost her two children in Kyaka.

source: foorogora
en: To change butter sauce from pot to bowl and bowl to pot till water in which butter is being cooked has changed to white

source: footooka
en: To grow soft and baby, be deflated

source: omupiira gwa motoka ye gukafootookera omukiikaro ekibi
en: The tyre for his/her car got deflated in a dangerous place

source: fooba
en: To plait, interlace, tack in

source: -amabingo bakozeseze ekiaali bakagafoobera kukikozesa kurungi.
en: -the reeds which they used for the King's enclosure were interlaced so as to make it look smart.

source: foobera
en: Of a soft thing, to be easily compressed, fall in and upward when pressed

source: fooka
en: Become, be made, change, draw (a bow)

source: omukozi yaleesire akamufookera kasaarre
en: The workman he/she employed became a problem to him/her.

source: footookeerra
en: To be vacillating, unsteady

source: footora
en: To squash

source: foototora
en: To defecate, void feaces anonymously

source: fuba
en: To cause misfortune, bring bad luck

source: endagu ifubire
en: Divination has given information of misfortune

source: -amata agafiire gayine kunangwa
en: -bad milk should be thrown away

source: fubata
en: To be tightly covered up

source: omuhiiha tigufubasire kurungi hakyanzi; omukazi onu emihiiha ye tagifubasa kurungi habyanzi
en: The lid is not holding tightly on the wooden milk vessel; This woman does not see to it that the lids do fubeera fukumura bold tightly on the wooden milk vessel

source: fubeera
en: To have second thought when you are ready to do something, e.g. Spearing

source: fubeereza
en: Dismay, confound

source: fubeerra
en: To slow down, be dismayed, draw back, slacken speed

source: fubika
en: To warp up.(a person)

source: bintu bibiri abakazi ebi bakira kufubikisa abaana baabo
en: There are two things which parents commonly use io wrapping their children

source: fubira
en: To punish, frustrate

source: Nyinenkuru nyowe akafubire batahi bange.
en: -my grandmother punished my friends.

source: fufuza
en: To go alone through dense forest,etc

source: obu yacwire omunkomo kuhika owaabu akafufuliza omukibira
en: When he escaped from prison he walked through a dense forest to reach home

source: fuguta
en: To pump, blow (bellows)

source: omuheesi aheesa n'omwojo ow'okumufutiraira omujuba; omujuba bagufugusa orulw orubohwa hankero yagwo
en: A black smith forges iron with a boy who blows the bellows for him; The bellow is pumped by pressing the skin tied on its nozzle

source: fuka
en: To grow cold, blow nose

source: amaizi akaba naagya kwoga akabanza kugafukya
en: He/she first made cold the water that he/she was going to use for bathing

source: fukaana
en: To wrestle

source: bakafukaanira harubaju rw'ekisaaru baitu hatabeho n 'omu ayanagire mugenzi we hansi
en: They wrestled at the side of a river but no one threw the other down

source: fukama
en: Used of breasts of young girls about 16 years of age

source: akaswerwa amabeere nigafukama kugwa
en: She got married at the age of 16 years, when her breasts were just begin ing to grow

source: fukiiriza
en: To cool with water, refresh

source: fukumuka
en: To come out in large amounts as water from ground (content of gourd)

source: fukumura
en: To shake out (contents of gourd )

source: fuleeteza
en: To tie tightly (as rope around the neck). Fuliiteza = ful eeteza, ku-, oku- v.tr

source: fuma
en: To prod,thrust

source: -omusuma bokamufumira omumadaara g'ekitobu.
en: -A thief was thrusted while he was under the bed.

source: fumba
en: To push away through (where there is no path)

source: nambere hataabaga nguudo abaana abaazindukaga, baafumbaga orume buli nyekya
en: Where there were no roads children who travelled early in the morning, had to pass through dewy grass on their way daily

source: fumbagiriza
en: To elbow one's way through, to push out of the way

source: fumbasa
en: To clasp

source: fumbata
en: To embrance,

source: fumura
en: To piece,bore,lance

source: funda
en: To be narrow, confined, cling to

source: oruguudo rufimdiire nambere rukaba rutasemeriire kufimdira
en: The road narrowed where it was not supposed to be narrowed

source: fundaana
en: To be crowded together, be stifled, be suffocated

source: funduka
en: To come up (esp. Mushrooms), grow (hump)

source: /.omaiso
en: Have protruding eyes

source: fumbatiza
en: To clasp in the hand

source: fundukura
en: To uncover, take the lid off

source: ky 'akohiecupa yo sooda kugifundukuzo amaino
en: It is dangerous to open a bottle of soda with fundura furuuta the teeth

source: fundura
en: Uncover

source: funduza
en: To show signs of coming out

source: omwana afundwize kuturuka
en: The baby is showing signs of coming out of the womb

source: funga
en: To fasten (e. G button)

source: fungwa
en: - hold up clothes

source: - fungwa ebijwaro
en: - she is holding up clothes or s ell.

source: fungiirra
en: To hold up (clothes)

source: funguka
en: To be djluted.

source: -Funguka obyokunywa ebyo
en: -dilute those drinks.

source: funuura
en: To masturbate, push back foreskin of penis

source: -batwasire omusigazi afunuura nyekyakara
en: -the boy was caught masturbating in the morning.

source: funya
en: To fold (trouser or sleeves)

source: -oyine kufunya esatii oli omukukora
en: -you are supposed to fold a shirt when u are working.

source: funyiirra
en: To turn up

source: -okufuunyiirra kubaho ayisomero
en: -you are supposed to turn up at school.

source: funyika
en: To crumple up, gather (in sewing)

source: furafura
en: To disparage, run down

source: tikihikire kufurafuurra omuntu omubantu
en: It is not right to disparage a person in public

source: furuka
en: To desert, migrate

source: -nkafuruka omuka
en: -I migrated from home.

source: furungu
en: To dilute too much, disparage, run down, change

source: -Ebigambo bye bakabifurungura tinukwo yabigambire,ati.
en: -they changed his words, that is not the way he/she said them.

source: furuuta
en: To be blistered, swell (as from bite or sting)

source: omubiri gwe gukaba nigumufurutira Kampala, obu yaizire Tooro gwaleka
en: His/her body used to swell while he/she was in Kampala, when he/ she returned to Tooro tt stopped

source: futana
en: To chew (soft substance), masticate

source: -maama akaba nafutana omubazi gwa akaana ke
en: -mother used to chew medicine for her child.

source: fuuha
en: To blow, snort

source: ente kukufuhira buli neekuseruza obulemu
en: If a cow snorts at you it is a sign of challenging you for a fight

source: -nakufuuhira musijaa wee.
en: -She is jealous of her husband

source: fuuhiza
en: To say God forbid

source: -nfuuhize ekibi
en: -said by a diviner when his/her divination show that danger is imminent

source: fuuhya
en: To prevent (evil), ward off, forbid

source: fuuka
en: To bubble, boil fast, froth, foam lather

source: amaarwa g 'ebitooke gafuukira omubisisi; ekifaukisa amaanva nubwo obutagasi obugatunga gakyali omukiina
en: Plantain beer froths in the gourds where it is kept; What makes a plantain wine to froths is the heat it gets while in the hole where it is kept for fermentation

source: fuukeera
en: To breathe with difficulty through the nose, snore, have nose stopped up

source: afuukeerra omubwire bw 'embeho; abatabani bakamufuruurra Mwenge
en: He/she breathes with diffculty during the cold season; His/her sons helped him/her migrate to Mwenge

source: fuuta
en: To fill mouth with food

source: fuutafuutiika
en: To bundle in any how, to stuff

source: jaallima
en: To talk nonsense

source: jaagira
en: To waddle, straddle, walk with legs wide open due to pain

source: akahanda kafunzire nikalemesa arukujaagira kukajaagiirraamu
en: A narrow path makes it difficult for a straddler to straddle in it

source: jaagiza
en: To cause one walk with legs wide open

source: jaagura
en: To beat, dig on the surface.
